QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_sysctl.h
#ifndef HW_SYSCTL_H
#define HW_SYSCTL_H

//*************************************************************************************************
//
// The following are defines for the SYSCTL register offsets
//
//*************************************************************************************************
/* DEV_CFG_REGS */
#define SYSCTL_O_SOFTPRES0  0x40U // Processing Block Software Reset register
#define SYSCTL_O_SOFTPRES2  0x44U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES3  0x48U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES4  0x4CU // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES6  0x50U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES7  0x54U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES8  0x58U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES9  0x5CU // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES10 0x60U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES13 0x64U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES14 0x68U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES15 0x6CU // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES16 0x70U // Peripheral Software Reset register
#define SYSCTL_O_SOFTPRES19 0x74U // Peripheral Software Reset register

#define SYSCTL_O_HARDWARERES0  0x140U // Processing Block Hardware Reset register
#define SYSCTL_O_HARDWARERES2  0x144U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES3  0x148U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES4  0x14CU // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES6  0x150U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES7  0x154U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES8  0x158U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES9  0x15CU // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES10 0x160U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES13 0x164U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES14 0x168U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES15 0x16CU // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES16 0x170U // Peripheral Hardware Reset register
#define SYSCTL_O_HARDWARERES19 0x174U // Peripheral Hardware Reset register

#define SYSCTL_O_CANFD                      0x190 // Canfd Enable Register
#define SYSCTL_O_FLASHCLKDIV                0x1A0 // Flash Clock Divider Register
#define SYSCTL_O_EMU_SUSPEND                0x1AC // Emulation Suspend Register
#define SYSCTL_O_GSRAM_SEL                  0x320 // GS RAM Select Register
#define SYSCTL_O_FARRAM_SEL                 0x324 // FAR RAM Select Register
#define SYSCTL_O_CPU1FARRAM_CTRL            0x328 // CPU1 FAR RAM Control Register
#define SYSCTL_O_CPU2FARRAM_CTRL            0x32C // CPU2 FAR RAM Control Register
#define SYSCTL_O_NMAVFLAG                   0x330 // Non-Master Access Violation Flag Register
#define SYSCTL_O_NMAVSET                    0x334 // Non-Master Access Violation Flag Set Register
#define SYSCTL_O_NMAVCLR                    0x338 // Non-Master Access Violation Flag Clear Register
#define SYSCTL_O_NMAVINTEN                  0x33C // Non-Master Access Violation Interrupt Enable Register
#define SYSCTL_O_NMCPU1WRAVADDR             0x340 // CPU1 Non-Master Read Access Violation Address
#define SYSCTL_O_NMCPU2WRAVADDR             0x344 // CPU2 Non-Master Read Access Violation Address
#define SYSCTL_O_DMA_CH1_BLK_DONE_INT_COUNT 0x348 // DMA Channel 1 Interrupt Counter Register
#define SYSCTL_O_DMA_CH2_BLK_DONE_INT_COUNT 0x34C // DMA Channel 2 Interrupt Counter Register
#define SYSCTL_O_DMA_CH3_BLK_DONE_INT_COUNT 0x350 // DMA Channel 3 Interrupt Counter Register
#define SYSCTL_O_DMA_CH4_BLK_DONE_INT_COUNT 0x354 // DMA Channel 4 Interrupt Counter Register
#define SYSCTL_O_DMA_CH5_BLK_DONE_INT_COUNT 0x358 // DMA Channel 5 Interrupt Counter Register
#define SYSCTL_O_DMA_CH6_BLK_DONE_INT_COUNT 0x35C // DMA Channel 6 Interrupt Counter Register

/* CLK_CFG_REGS */
#define SYSCTL_O_CLKSRCCTL1     0x00U // Clock Source Control register-1
#define SYSCTL_O_CLKSRCCTL2     0x04U // Clock Source Control register-2
#define SYSCTL_O_CLKSRCCTL3     0x08U // Clock Source Control register-3
#define SYSCTL_O_SYSPLLCTL1     0x0CU // SYSPLL Control register-1
#define SYSCTL_O_SYSPLLMULT     0x10U // SYSPLL Multiplier register
#define SYSCTL_O_SYSPLL_IMULT_L 0x14U // SYSPLL SYSPLL_IMULT_L register
#define SYSCTL_O_SYSPLL_IMULT_H 0x18U // SYSPLL SYSPLL_IMULT_H register
#define SYSCTL_O_SYSPLL_ODIV    0x1CU // SYSPLL SYSPLL_ODIV register
#define SYSCTL_O_SYSPLLSTS      0x20U // SYSPLL Status register
#define SYSCTL_O_SYSCLKDIVSEL   0x24U // System Clock Divider Select register
#define SYSCTL_O_XCLKOUTDIVSEL  0x28U // XCLKOUT Divider Select register
#define SYSCTL_O_LOSPCP         0x2CU // Low Speed Clock Source Prescalar
#define SYSCTL_O_MCDCR          0x30U // Missing Clock Detect Control Register
#define SYSCTL_O_X1CNT          0x34U // 10-bit Counter on X1 Clock
#define SYSCTL_O_XTALCR         0x38U // XTAL Control Register
#define SYSCTL_O_CLKSTATUS      0x3CU // CLK Status Register

/* CPU_SYS_REGS */
#define SYSCTL_O_PCLKCR0      0x00U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR2      0x04U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR3      0x08U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR4      0x0CU // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR6      0x10U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR7      0x14U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR8      0x18U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR9      0x1CU // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR10     0x20U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR13     0x24U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR14     0x28U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR15     0x2CU // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR16     0x30U // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR19     0x34U // Peripheral Clock Gating Registers
#define SYSCTL_O_CPU1EXPSTART 0x38U // CPU1 exception vector Start Address Register
#define SYSCTL_O_CPU2EXPSTART 0x3CU // CPU2 exception vector Start Address Register
#define SYSCTL_O_LPMCR        0x78U // LPM Control Register
#define SYSCTL_O_HHRPWM       0x7CU // HHRPWM enable Register
#define SYSCTL_O_TMR2CLKCTL   0x80U // Timer2 Clock Measurement functionality control register
#define SYSCTL_O_GPIOLPMSEL0  0x84U // GPIO LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL1  0x88U // GPIO LPM Wakeup select registers
#define SYSCTL_O_RESCCLR      0x8CU // Reset Cause Clear Register
#define SYSCTL_O_RESC         0x90U // Reset Cause register

