QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_sysctl.h
#define SYSCTL_O_SCSR   0x00U // System Control & Status Register
#define SYSCTL_O_WDCNTR 0x04U // Watchdog Counter Register
#define SYSCTL_O_WDKEY  0x08U // Watchdog Reset Key Register
#define SYSCTL_O_WDCR   0x0CU // Watchdog Control Register
#define SYSCTL_O_WDWCR  0x10U // Watchdog Windowed Control Register

#define SYSCTL_O_SYNCSELECT      0x0U // Sync Input and Output Select Register
#define SYSCTL_O_ADCSOCOUTSELECT 0x4U // External ADCSOC Select Register
#define SYSCTL_O_SYNCSOCLOCK     0x8U // SYNCSEL and EXTADCSOC Select Lock register

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES0 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES0_CPU2 0x1U // CPU2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES2 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES2_EPWM1  0x1U   // EPWM1 software reset bit
#define SYSCTL_SOFTPRES2_EPWM2  0x2U   // EPWM2 software reset bit
#define SYSCTL_SOFTPRES2_EPWM3  0x4U   // EPWM3 software reset bit
#define SYSCTL_SOFTPRES2_EPWM4  0x8U   // EPWM4 software reset bit
#define SYSCTL_SOFTPRES2_EPWM5  0x10U  // EPWM5 software reset bit
#define SYSCTL_SOFTPRES2_EPWM6  0x20U  // EPWM6 software reset bit
#define SYSCTL_SOFTPRES2_EPWM7  0x40U  // EPWM7 software reset bit
#define SYSCTL_SOFTPRES2_EPWM8  0x80U  // EPWM8 software reset bit
#define SYSCTL_SOFTPRES2_EPWM9  0x100U // EPWM9 software reset bit
#define SYSCTL_SOFTPRES2_EPWM10 0x200U // EPWM10 software reset bit
#define SYSCTL_SOFTPRES2_EPWM11 0x400U // EPWM11 software reset bit
#define SYSCTL_SOFTPRES2_EPWM12 0x800U // EPWM12 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES3 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES3_ECAP1 0x1U  // ECAP1 software reset bit
#define SYSCTL_SOFTPRES3_ECAP2 0x2U  // ECAP2 software reset bit
#define SYSCTL_SOFTPRES3_ECAP3 0x4U  // ECAP3 software reset bit
#define SYSCTL_SOFTPRES3_ECAP4 0x8U  // ECAP4 software reset bit
#define SYSCTL_SOFTPRES3_ECAP5 0x10U // ECAP5 software reset bit
#define SYSCTL_SOFTPRES3_ECAP6 0x20U // ECAP6 software reset bit
#define SYSCTL_SOFTPRES3_ECAP7 0x40U // ECAP7 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES4 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES4_EQEP1 0x1U // EQEP1 software reset bit
#define SYSCTL_SOFTPRES4_EQEP2 0x2U // EQEP2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES6 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES6_SD1 0x1U // SD1 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES7 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES7_SCI_A 0x1U // SCI_A software reset bit
#define SYSCTL_SOFTPRES7_SCI_B 0x2U // SCI_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES8 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES8_SPI_A 0x1U // SPI_A software reset bit
#define SYSCTL_SOFTPRES8_SPI_B 0x2U // SPI_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES9 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES9_I2C_A 0x1U // I2C_A software reset bit
#define SYSCTL_SOFTPRES9_PMBUS 0x2U // PMBUS software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES10 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES10_CAN_A 0x1U // CAN_A software reset bit
#define SYSCTL_SOFTPRES10_CAN_B 0x2U // CAN_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES13 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES13_ADC_A    0x1U   // ADC_A software reset bit
#define SYSCTL_SOFTPRES13_ADC_B    0x2U   // ADC_B software reset bit
#define SYSCTL_SOFTPRES13_ADC_C    0x4U   // ADC_C software reset bit
#define SYSCTL_SOFTPRES13_ADC_G    0x8U   // ADC_G software reset bit
#define SYSCTL_SOFTPRES13_ADC_H    0x10U  // ADC_H software reset bit
#define SYSCTL_SOFTPRES13_ADC_A_HR 0x40U  // ADC_A_HR software reset bit
#define SYSCTL_SOFTPRES13_ADC_B_HR 0x80U  // ADC_B_HR software reset bit
#define SYSCTL_SOFTPRES13_ADC_C_HR 0x100U // ADC_C_HR software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES14 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES14_CMPSS1 0x1U  // CMPSS1 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS2 0x2U  // CMPSS2 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS3 0x4U  // CMPSS3 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS4 0x8U  // CMPSS4 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS5 0x10U // CMPSS5 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS6 0x20U // CMPSS6 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS7 0x40U // CMPSS7 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES15 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES15_PGA1 0x1U  // PGA1 software reset bit
#define SYSCTL_SOFTPRES15_PGA2 0x2U  // PGA2 software reset bit
#define SYSCTL_SOFTPRES15_PGA3 0x4U  // PGA3 software reset bit
#define SYSCTL_SOFTPRES15_PGA4 0x8U  // PGA4 software reset bit
#define SYSCTL_SOFTPRES15_PGA5 0x10U // PGA5 software reset bit
#define SYSCTL_SOFTPRES15_PGA6 0x20U // PGA6 software reset bit
#define SYSCTL_SOFTPRES15_PGA7 0x40U // PGA7 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES16 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES16_DAC_A 0x10000U // Buffered_DAC_A software reset bit
#define SYSCTL_SOFTPRES16_DAC_B 0x20000U // Buffered_DAC_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES19 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES19_LIN_A 0x1U // LIN_A software reset bit
#define SYSCTL_SOFTPRES19_XINTF 0x2U // XINTF software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES2 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES2_EPWM1_EALLOW  0x1U   // EPWM1 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM2_EALLOW  0x2U   // EPWM2 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM3_EALLOW  0x4U   // EPWM3 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM4_EALLOW  0x8U   // EPWM4 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM5_EALLOW  0x10U  // EPWM5 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM6_EALLOW  0x20U  // EPWM6 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM7_EALLOW  0x40U  // EPWM7 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM8_EALLOW  0x80U  // EPWM8 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM9_EALLOW  0x100U // EPWM9 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM10_EALLOW 0x200U // EPWM10 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM11_EALLOW 0x400U // EPWM11 hardware reset and eallow bit
#define SYSCTL_HARDWARERES2_EPWM12_EALLOW 0x800U // EPWM12 hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES3 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES3_ECAP1_EALLOW 0x1U  // ECAP1 hardware reset and eallow bit
#define SYSCTL_HARDWARERES3_ECAP2_EALLOW 0x2U  // ECAP2 hardware reset and eallow bit
#define SYSCTL_HARDWARERES3_ECAP3_EALLOW 0x4U  // ECAP3 hardware reset and eallow bit
#define SYSCTL_HARDWARERES3_ECAP4_EALLOW 0x8U  // ECAP4 hardware reset and eallow bit
#define SYSCTL_HARDWARERES3_ECAP5_EALLOW 0x10U // ECAP5 hardware reset and eallow bit
#define SYSCTL_HARDWARERES3_ECAP6_EALLOW 0x20U // ECAP6 hardware reset and eallow bit
#define SYSCTL_HARDWARERES3_ECAP7_EALLOW 0x40U // ECAP7 hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES4 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES4_EQEP1_EALLOW 0x1U // EQEP1 hardware reset and eallow bit
#define SYSCTL_HARDWARERES4_EQEP2_EALLOW 0x2U // EQEP2 hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES6 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES6_SD1_EALLOW 0x1U // SD1 hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES7 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES7_SCI_A 0x1U // SCI_A hardware reset bit
#define SYSCTL_HARDWARERES7_SCI_B 0x2U // SCI_B hardware reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES8 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES8_SPI_A 0x1U // SPI_A hardware reset bit
#define SYSCTL_HARDWARERES8_SPI_B 0x2U // SPI_B hardware reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES9 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES9_I2C_A 0x1U // I2C_A hardware reset bit
#define SYSCTL_HARDWARERES9_PMBUS 0x2U // PMBUS hardware reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES10 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES10_CAN_A 0x1U // CAN_A hardware reset bit
#define SYSCTL_HARDWARERES10_CAN_B 0x2U // CAN_B hardware reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES13 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES13_ADC_A_EALLOW    0x1U   // ADC_A hardware reset and eallow bit
#define SYSCTL_HARDWARERES13_ADC_B_EALLOW    0x2U   // ADC_B hardware reset and eallow bit
#define SYSCTL_HARDWARERES13_ADC_C_EALLOW    0x4U   // ADC_C hardware reset and eallow bit
#define SYSCTL_HARDWARERES13_ADC_G_EALLOW    0x8U   // ADC_G hardware reset and eallow bit
#define SYSCTL_HARDWARERES13_ADC_H_EALLOW    0x10U  // ADC_H hardware reset and eallow bit
#define SYSCTL_HARDWARERES13_ADC_A_HR_EALLOW 0x40U  // ADC_A_HR hardware reset and eallow bit
#define SYSCTL_HARDWARERES13_ADC_B_HR_EALLOW 0x80U  // ADC_B_HR hardware reset and eallow bit
#define SYSCTL_HARDWARERES13_ADC_C_HR_EALLOW 0x100U // ADC_C_HR hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES14 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES14_CMPSS1_EALLOW 0x1U  // CMPSS1 hardware reset and eallow bit
#define SYSCTL_HARDWARERES14_CMPSS2_EALLOW 0x2U  // CMPSS2 hardware reset and eallow bit
#define SYSCTL_HARDWARERES14_CMPSS3_EALLOW 0x4U  // CMPSS3 hardware reset and eallow bit
#define SYSCTL_HARDWARERES14_CMPSS4_EALLOW 0x8U  // CMPSS4 hardware reset and eallow bit
#define SYSCTL_HARDWARERES14_CMPSS5_EALLOW 0x10U // CMPSS5 hardware reset and eallow bit
#define SYSCTL_HARDWARERES14_CMPSS6_EALLOW 0x20U // CMPSS6 hardware reset and eallow bit
#define SYSCTL_HARDWARERES14_CMPSS7_EALLOW 0x40U // CMPSS7 hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES15 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES15_PGA1_EALLOW 0x1U  // PGA1 hardware reset and eallow bit
#define SYSCTL_HARDWARERES15_PGA2_EALLOW 0x2U  // PGA2 hardware reset and eallow bit
#define SYSCTL_HARDWARERES15_PGA3_EALLOW 0x4U  // PGA3 hardware reset and eallow bit
#define SYSCTL_HARDWARERES15_PGA4_EALLOW 0x8U  // PGA4 hardware reset and eallow bit
#define SYSCTL_HARDWARERES15_PGA5_EALLOW 0x10U // PGA5 hardware reset and eallow bit
#define SYSCTL_HARDWARERES15_PGA6_EALLOW 0x20U // PGA6 hardware reset and eallow bit
#define SYSCTL_HARDWARERES15_PGA7_EALLOW 0x40U // PGA7 hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES16 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES16_DAC_A_EALLOW 0x10000U // Buffered_DAC_A hardware reset and eallow bit
#define SYSCTL_HARDWARERES16_DAC_B_EALLOW 0x20000U // Buffered_DAC_B hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HARDWARERES19 register
//
//*************************************************************************************************
#define SYSCTL_HARDWARERES19_LIN_A               0x1U  // LIN_A hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_XINTF               0x2U  // XINTF hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_FSI_EALLOW          0x4U  // FSI hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_ANALOGSUBSYS_EALLOW 0x8U  // ANALOGSUBSYS hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_INPUTBAR_EALLOW     0x10U // INPUTBAR hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_EPWMBAR_EALLOW      0x20U // EPWMBAR hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_OUTPUTBAR_EALLOW    0x40U // OUTPUTBAR hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_SYSCTRL_EALLOW      0x80U // SYSCTRL hardware reset and eallow bit
#define SYSCTL_HARDWARERES19_IOMUX_EALLOW        0x100U // IOMUX hardware reset and eallow bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CANFD register
//
//*************************************************************************************************
#define SYSCTL_CANFD_CANFD0 0x1U // CANFD0 enable bit
#define SYSCTL_CANFD_CANFD1 0x2U // CANFD1 enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the FLASHCLKDIV register
//
//*************************************************************************************************
#define SYSCTL_FLASHCLKDIV_CLK_FLASH_DIV_NUM_S 0U
#define SYSCTL_FLASHCLKDIV_CLK_FLASH_DIV_NUM_M 0xFFFFU // flash moudle clock divides

//*************************************************************************************************
//
// The following are defines for the bit fields in the EMU_SUSPEND register
//
//*************************************************************************************************
#define SYSCTL_EMU_SUSPEND_ADCA   0x1U      // Emulation Suspend for ADCA bit
#define SYSCTL_EMU_SUSPEND_ADCB   0x2U      // Emulation Suspend for ADCB bit
#define SYSCTL_EMU_SUSPEND_ADCC   0x4U      // Emulation Suspend for ADCC bit
#define SYSCTL_EMU_SUSPEND_EPWM1  0x8U      // Emulation Suspend for epwm1 bit
#define SYSCTL_EMU_SUSPEND_EPWM2  0x10U     // Emulation Suspend for epwm2 bit
#define SYSCTL_EMU_SUSPEND_EPWM3  0x20U     // Emulation Suspend for epwm3 bit
#define SYSCTL_EMU_SUSPEND_EPWM4  0x40U     // Emulation Suspend for epwm4 bit
#define SYSCTL_EMU_SUSPEND_EPWM5  0x80U     // Emulation Suspend for epwm5 bit
#define SYSCTL_EMU_SUSPEND_EPWM6  0x100U    // Emulation Suspend for epwm6 bit
#define SYSCTL_EMU_SUSPEND_EPWM7  0x200U    // Emulation Suspend for epwm7 bit
#define SYSCTL_EMU_SUSPEND_EPWM8  0x400U    // Emulation Suspend for epwm8 bit
#define SYSCTL_EMU_SUSPEND_EPWM9  0x800U    // Emulation Suspend for epwm9 bit
#define SYSCTL_EMU_SUSPEND_EPWM10 0x1000U   // Emulation Suspend for epwm10 bit
#define SYSCTL_EMU_SUSPEND_EPWM11 0x2000U   // Emulation Suspend for epwm11 bit
#define SYSCTL_EMU_SUSPEND_EPWM12 0x4000U   // Emulation Suspend for epwm12 bit
#define SYSCTL_EMU_SUSPEND_ECAP1  0x8000U   // Emulation Suspend for ecap1 bit
#define SYSCTL_EMU_SUSPEND_ECAP2  0x10000U  // Emulation Suspend for ecap2 bit
#define SYSCTL_EMU_SUSPEND_ECAP3  0x20000U  // Emulation Suspend for ecap3 bit
#define SYSCTL_EMU_SUSPEND_ECAP4  0x40000U  // Emulation Suspend for ecap4 bit
#define SYSCTL_EMU_SUSPEND_ECAP5  0x80000U  // Emulation Suspend for ecap5 bit
#define SYSCTL_EMU_SUSPEND_ECAP6  0x100000U // Emulation Suspend for ecap6 bit
#define SYSCTL_EMU_SUSPEND_ECAP7  0x200000U // Emulation Suspend for ecap7 bit
#define SYSCTL_EMU_SUSPEND_EQEP0  0x400000U // Emulation Suspend for eqep0 bit
#define SYSCTL_EMU_SUSPEND_EQEP1  0x800000U // Emulation Suspend for eqep1 bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL1 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_S 0U
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_M 0x3U  // OSCCLK Source Select Bit
#define SYSCTL_CLKSRCCTL1_INTOSC2OFF     0x8U  // Internal Oscillator 2 Off Bit
#define SYSCTL_CLKSRCCTL1_WDHALTI        0x20U // Watchdog HALT Mode Ignore Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL2 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL2_CANABCLKSEL_S 2U
#define SYSCTL_CLKSRCCTL2_CANABCLKSEL_M 0xCU // CANA Bit Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_CANBBCLKSEL_S 4U
#define SYSCTL_CLKSRCCTL2_CANBBCLKSEL_M 0x30U // CANB Bit Clock Source Select Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL3 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_S 0U
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_M 0x7U // XCLKOUT Source Select Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSPLLCTL1 register
//
//*************************************************************************************************
#define SYSCTL_SYSPLLCTL1_PLLEN    0x1U // SYSPLL enable/disable bit
#define SYSCTL_SYSPLLCTL1_PLLCLKEN 0x2U // SYSPLL bypassed or included in the PLLSYSCLK path

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSPLLMULT register
//
//*************************************************************************************************
#define SYSCTL_SYSPLLMULT_IDIV_S 0U
#define SYSCTL_SYSPLLMULT_IDIV_M 0x0000FU   // SYSPLL Fractional Multiplier
#define SYSCTL_SYSPLLMULT_RST    0x8000000U // Reset Mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSPLLSTS register
//
//*************************************************************************************************
#define SYSCTL_SYSPLLSTS_LOCKS 0x1U // SYSPLL Lock Status Bit
#define SYSCTL_SYSPLLSTS_SLIPS 0x2U // SYSPLL Slip Status Bit

