QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSCLKDIVSEL register
//
//*************************************************************************************************
#define SYSCTL_SYSCLKDIVSEL_PLLSYSCLKDIV_S 0U
#define SYSCTL_SYSCLKDIVSEL_PLLSYSCLKDIV_M 0x3FU // PLLSYSCLK Divide Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCLKOUTDIVSEL register
//
//*************************************************************************************************
#define SYSCTL_XCLKOUTDIVSEL_XCLKOUTDIV_S 0U
#define SYSCTL_XCLKOUTDIVSEL_XCLKOUTDIV_M 0x3U // XCLKOUT Divide Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the LOSPCP register
//
//*************************************************************************************************
#define SYSCTL_LOSPCP_LSPCLKDIV_S 0U
#define SYSCTL_LOSPCP_LSPCLKDIV_M 0x7U // LSPCLK Divide Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCDCR register
//
//*************************************************************************************************
#define SYSCTL_MCDCR_MCLKSTS 0x1U // Missing Clock Status Bit
#define SYSCTL_MCDCR_MCLKCLR 0x2U // Missing Clock Clear Bit
#define SYSCTL_MCDCR_MCLKOFF 0x4U // Missing Clock Detect Off Bit
#define SYSCTL_MCDCR_OSCOFF  0x8U // Oscillator Clock Off Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the X1CNT register
//
//*************************************************************************************************
#define SYSCTL_X1CNT_X1CNT_S 0U
#define SYSCTL_X1CNT_X1CNT_M 0x3FFU   // X1 Counter
#define SYSCTL_X1CNT_CLR     0x10000U // X1 Counter Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTALCR register
//
//*************************************************************************************************
#define SYSCTL_XTALCR_OSCOFF 0x1U // XTAL Oscillator powered-down
#define SYSCTL_XTALCR_SE     0x2U // XTAL Oscilator in Single-Ended mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSTATUS register
//
//*************************************************************************************************
#define SYSCTL_CLKSTATUS_OSC1READLY 0x1U // OSC1 Readly
#define SYSCTL_CLKSTATUS_OSC2READLY 0x2U // OSC2 Readly
#define SYSCTL_CLKSTATUS_X1READLY   0x4U // X1 Readly

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR0 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR0_CPU2       0x1U     // CPU2 Clock Enable Bit
#define SYSCTL_PCLKCR0_DMA        0x4U     // DMA Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER0  0x20U    // CPU1 TIMER0 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER1  0x40U    // CPU1 TIMER1 Clock Enable bit
#define SYSCTL_PCLKCR0_CPUTIMER2  0x80U    // CPU1 TIMER2 Clock Enable bit
#define SYSCTL_PCLKCR0_CPU2TIMER0 0x100U   // CPU2 TIMER0 Clock Enable bit
#define SYSCTL_PCLKCR0_CPU2TIMER1 0x200U   // CPU2 TIMER1 Clock Enable bit
#define SYSCTL_PCLKCR0_CPU2TIMER2 0x400U   // CPU2 TIMER2 Clock Enable bit
#define SYSCTL_PCLKCR0_HRPWM      0x10000U // HRPWM Clock Enable Bit(just for compatable)
#define SYSCTL_PCLKCR0_TBCLKSYNC  0x40000U // EPWM Time Base Clock sync

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR2 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR2_EPWM1  0x1U   // EPWM1 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM2  0x2U   // EPWM2 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM3  0x4U   // EPWM3 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM4  0x8U   // EPWM4 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM5  0x10U  // EPWM5 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM6  0x20U  // EPWM6 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM7  0x40U  // EPWM7 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM8  0x80U  // EPWM8 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM9  0x100U // EPWM9 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM10 0x200U // EPWM10 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM11 0x400U // EPWM11 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM12 0x800U // EPWM12 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR3 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR3_ECAP1 0x1U  // ECAP1 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP2 0x2U  // ECAP2 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP3 0x4U  // ECAP3 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP4 0x8U  // ECAP4 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP5 0x10U // ECAP5 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP6 0x20U // ECAP6 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP7 0x40U // ECAP7 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR4 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR4_EQEP1 0x1U // EQEP1 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP2 0x2U // EQEP2 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR6 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR6_SD1 0x1U // SD1 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR7 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR7_SCI_A 0x1U // SCI_A Clock Enable bit
#define SYSCTL_PCLKCR7_SCI_B 0x2U // SCI_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR8 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR8_SPI_A 0x1U // SPI_A Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_B 0x2U // SPI_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR9 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR9_I2C_A   0x1U // I2C_A Clock Enable bit
#define SYSCTL_PCLKCR9_PMBUS_A 0x2U // PMBUS Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR10 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR10_CAN_A 0x1U // CAN_A Clock Enable bit
#define SYSCTL_PCLKCR10_CAN_B 0x2U // CAN_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR13 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR13_ADC_A    0x1U   // ADC_A Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_B    0x2U   // ADC_B Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_C    0x4U   // ADC_C Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_G    0x8U   // ADC_G Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_H    0x10U  // ADC_H Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_A_HR 0x40U  // ADC_A_HR software reset bit
#define SYSCTL_PCLKCR13_ADC_B_HR 0x80U  // ADC_B_HR software reset bit
#define SYSCTL_PCLKCR13_ADC_C_HR 0x100U // ADC_C_HR software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR14 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR14_CMPSS1 0x1U  // CMPSS1 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS2 0x2U  // CMPSS2 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS3 0x4U  // CMPSS3 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS4 0x8U  // CMPSS4 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS5 0x10U // CMPSS5 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS6 0x20U // CMPSS6 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS7 0x40U // CMPSS7 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR15 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR15_PGA1 0x1U  // PGA1 Clock Enable bit
#define SYSCTL_PCLKCR15_PGA2 0x2U  // PGA2 Clock Enable bit
#define SYSCTL_PCLKCR15_PGA3 0x4U  // PGA3 Clock Enable bit
#define SYSCTL_PCLKCR15_PGA4 0x8U  // PGA4 Clock Enable bit
#define SYSCTL_PCLKCR15_PGA5 0x10U // PGA5 Clock Enable bit
#define SYSCTL_PCLKCR15_PGA6 0x20U // PGA6 Clock Enable bit
#define SYSCTL_PCLKCR15_PGA7 0x40U // PGA7 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR16 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR16_DAC_A 0x10000U // Buffered_DAC_A Clock Enable Bit
#define SYSCTL_PCLKCR16_DAC_B 0x20000U // Buffered_DAC_B Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR19 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR19_LIN_A 0x1U // LIN_A Clock Enable bit
#define SYSCTL_PCLKCR19_XINTF 0x2U // XINTF Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPMCR register
//
//*************************************************************************************************
#define SYSCTL_LPMCR_LPM_S      0U
#define SYSCTL_LPMCR_LPM_M      0x3U // Low Power Mode setting
#define SYSCTL_LPMCR_WDINTE     0x4U // watchdog inttrupt enable
#define SYSCTL_LPMCR_GPIOLSPSEL 0x8U // Gpio low power select

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPIOLPMSEL0 register
//
//*************************************************************************************************
#define SYSCTL_GPIOLPMSEL0_GPIO0  0x1U        // GPIO0 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO1  0x2U        // GPIO1 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO2  0x4U        // GPIO2 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO3  0x8U        // GPIO3 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO4  0x10U       // GPIO4 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO5  0x20U       // GPIO5 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO6  0x40U       // GPIO6 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO7  0x80U       // GPIO7 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO8  0x100U      // GPIO8 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO9  0x200U      // GPIO9 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO10 0x400U      // GPIO10 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO11 0x800U      // GPIO11 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO12 0x1000U     // GPIO12 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO13 0x2000U     // GPIO13 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO14 0x4000U     // GPIO14 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO15 0x8000U     // GPIO15 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO16 0x10000U    // GPIO16 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO17 0x20000U    // GPIO17 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO18 0x40000U    // GPIO18 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO19 0x80000U    // GPIO19 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO20 0x100000U   // GPIO20 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO21 0x200000U   // GPIO21 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO22 0x400000U   // GPIO22 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO23 0x800000U   // GPIO23 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO24 0x1000000U  // GPIO24 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO25 0x2000000U  // GPIO25 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO26 0x4000000U  // GPIO26 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO27 0x8000000U  // GPIO27 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO28 0x10000000U // GPIO28 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO29 0x20000000U // GPIO29 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO30 0x40000000U // GPIO30 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO31 0x80000000U // GPIO31 Enable for LPM Wakeup

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPIOLPMSEL1 register
//
//*************************************************************************************************
#define SYSCTL_GPIOLPMSEL1_GPIO32 0x1U        // GPIO32 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO33 0x2U        // GPIO33 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO34 0x4U        // GPIO34 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO35 0x8U        // GPIO35 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO36 0x10U       // GPIO36 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO37 0x20U       // GPIO37 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO38 0x40U       // GPIO38 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO39 0x80U       // GPIO39 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO40 0x100U      // GPIO40 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO41 0x200U      // GPIO41 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO42 0x400U      // GPIO42 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO43 0x800U      // GPIO43 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO44 0x1000U     // GPIO44 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO45 0x2000U     // GPIO45 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO46 0x4000U     // GPIO46 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO47 0x8000U     // GPIO47 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO48 0x10000U    // GPIO48 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO49 0x20000U    // GPIO49 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO50 0x40000U    // GPIO50 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO51 0x80000U    // GPIO51 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO52 0x100000U   // GPIO52 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO53 0x200000U   // GPIO53 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO54 0x400000U   // GPIO54 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO55 0x800000U   // GPIO55 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO56 0x1000000U  // GPIO56 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO57 0x2000000U  // GPIO57 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO58 0x4000000U  // GPIO58 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO59 0x8000000U  // GPIO59 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO60 0x10000000U // GPIO60 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO61 0x20000000U // GPIO61 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO62 0x40000000U // GPIO62 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO63 0x80000000U // GPIO63 Enable for LPM Wakeup

//*************************************************************************************************
//
// The following are defines for the bit fields in the TMR2CLKCTL register
//
//*************************************************************************************************
#define SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_S       0U
#define SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_M       0x7U // CPU1 Timer 2 Clock Source Select Bit
#define SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_S     3U
#define SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_M     0x38U // CPU1 Timer 2 Clock Pre-Scale Value
#define SYSCTL_TMR2CLKCTL_CPU2TMR2CLKSRCSEL_S   8U
#define SYSCTL_TMR2CLKCTL_CPU2TMR2CLKSRCSEL_M   0x300U // CPU2 Timer 2 Clock Source Select Bit
#define SYSCTL_TMR2CLKCTL_CPU2TMR2CLKPRESCALE_S 11U
#define SYSCTL_TMR2CLKCTL_CPU2TMR2CLKPRESCALE_M 0x3800U // CPU2 Timer 2 Clock Pre-Scale Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the RESCCLR register
//
//*************************************************************************************************
#define SYSCTL_RESCCLR_POR           0x1U   // CPU1 POR Reset Cause Indication Bit
#define SYSCTL_RESCCLR_XRSN          0x2U   // CPU1 XRSn Reset Cause Indication Bit
#define SYSCTL_RESCCLR_WDRSN         0x4U   // CPU1 WDRSn Reset Cause Indication Bit
#define SYSCTL_RESCCLR_NMIWDRSN      0x8U   // CPU1 NMIWDRSn Reset Cause Indication Bit
#define SYSCTL_RESCCLR_CPU2_POR      0x10U  // CPU2 POR Reset Cause Indication Bit
#define SYSCTL_RESCCLR_CPU2_XRSN     0x20U  // CPU2 XRSn Reset Cause Indication Bit
#define SYSCTL_RESCCLR_CPU2_WDRSN    0x40U  // CPU2 WDRSn Reset Cause Indication Bit
#define SYSCTL_RESCCLR_CPU2_NMIWDRSN 0x80U  // CPU2 NMIWDRSn Reset Cause Indication Bit
#define SYSCTL_RESCCLR_DBGRSN        0x100U // CPU1 Debug Reset Cause Indication Bit
#define SYSCTL_RESCCLR_CPU2_DBGRSN   0x200U // CPU2 Debug Reset Cause Indication Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the RESC register
//
//*************************************************************************************************
#define SYSCTL_RESC_POR             0x1U        // CPU1 POR Reset Cause Indication Bit
#define SYSCTL_RESC_XRSN            0x2U        // CPU1 XRSn Reset Cause Indication Bit
#define SYSCTL_RESC_WDRSN           0x4U        // CPU1 WDRSn Reset Cause Indication Bit
#define SYSCTL_RESC_NMIWDRSN        0x8U        // CPU1 NMIWDRSn Reset Cause Indication Bit
#define SYSCTL_RESC_CPU2_POR        0x10U       // CPU2 POR Reset Cause Indication Bit
#define SYSCTL_RESC_CPU2_XRSN       0x20U       // CPU2 XRSn Reset Cause Indication Bit
#define SYSCTL_RESC_CPU2_WDRSN      0x40U       // CPU2 WDRSn Reset Cause Indication Bit
#define SYSCTL_RESC_CPU2_NMIWDRSN   0x80U       // CPU2 NMIWDRSn Reset Cause Indication Bit
#define SYSCTL_RESC_DBGRSN          0x100U      // CPU1 Debug Reset Cause Indication Bit
#define SYSCTL_RESC_CPU2_DBGRSN     0x200U      // CPU2 Debug Reset Cause Indication Bit
#define SYSCTL_RESC_XRSN_PIN_STATUS 0x20000000U // XRSN Pin Status
#define SYSCTL_RESC_DCON            0x40000000U // CPU1 Debugger conntion status to C28x
#define SYSCTL_RESC_CPU2_DCON       0x80000000U // CPU2 Debugger conntion status to C28x

//*************************************************************************************************
//
// The following are defines for the bit fields in the SCSR register
//
//*************************************************************************************************
#define SYSCTL_SCSR_WDOVERRIDE 0x1U // WD Override for WDDIS bit
#define SYSCTL_SCSR_WDENINT    0x2U // WD Interrupt Enable
#define SYSCTL_SCSR_WDINTS     0x4U // WD Interrupt Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDCNTR register
//
//*************************************************************************************************
#define SYSCTL_WDCNTR_WDCNTR_S 0U
#define SYSCTL_WDCNTR_WDCNTR_M 0xFFU // WD Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDKEY register
//
//*************************************************************************************************
#define SYSCTL_WDKEY_WDKEY_S 0U
#define SYSCTL_WDKEY_WDKEY_M 0xFFU // Key to pet the watchdog timer.

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDCR register
//
//*************************************************************************************************
#define SYSCTL_WDCR_WDPS_S        0U
#define SYSCTL_WDCR_WDPS_M        0x7U // WD Clock Prescalar
#define SYSCTL_WDCR_WDCHK_S       3U
#define SYSCTL_WDCR_WDCHK_M       0x38U // WD Check Bits
#define SYSCTL_WDCR_WDDIS         0x40U // WD Disable
#define SYSCTL_WDCR_WDPRECLKDIV_S 8U
#define SYSCTL_WDCR_WDPRECLKDIV_M 0xF00U // WD Pre Clock Divider

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDWCR register
//
//*************************************************************************************************
#define SYSCTL_WDWCR_MIN_S 0U
#define SYSCTL_WDWCR_MIN_M \
    0xFFU // WD Min Threshold setting for Windowed Watchdog
          // functionality

